# GetElementsToDimension Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..GetElementsToDimension Method
MultiReferenceAnnotationOptions Class See Also
---
Gets the elements which the dimension will witness.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetElementsToDimension()
```

Visual Basic
---
```text
Public Function GetElementsToDimension As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetElementsToDimension()
```

# ### Return Value
The elements which the dimension will witness.
# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace